# 심사 사이트 사용하기
 # 파이썬 코딩도장은 책에서 배운 내용을 완전히 익힐 수 있도록 웹사이트에서 퀴즈와 심사문제를 제공
 # 퀴즈:객관식 문제와 짧은 답안을 입력하는 주관식 문제
 # 심사문제: 문제의 답안을 파이썬으로 작성하여 제출하는 방식 미완성된 코드에서 일부분만 제출하는 문제와 전체코드를 제출하는 문제
 # 웹 브라우저를 실행하고 다음 주소로 이동 https://dojang.io
 # 심사 사이트에서 퀴즈를 풀려면 회원 가입과 로그인이 필요(회원 가입을 하지 않아도 강좌는 볼 수 있음)
 # 화면 오른쪽 위의 로그인 링크 클릭
 # 구글 또는 페이스북 계정이 있으면 Log in with Google, Log in with Facebook 버튼을 클릭
 # 정보 제공을 허가하면 바로 회원 가입과 로그인이 됨
 # 만약 구글 또는 페이스북 계정을 사용하지 않으려면 다음 순서대로 회원 가입을 함
 # 화면 오른쪽 위의 로그인 링크 클릭
 # 새 계정 화면에서 회원 가입을 합니다(이메일 인증을 하므로 실제로 사용하는 이메일 주소를 입력)
 # 이메일 주소의 메일함에 계정 승인 메일이 도착해 있을 것.
 # 가입한 계정으로 로그인
 # 로그인을 하면 심사 사이트의 메인 화면이 나옴 여기서 이용할 수 있는 강좌 > 파이썬 코딩 도장 > 시작하기 버튼을 클릭
 # 퀴즈를 풀려면 먼저 강좌 등록
 # 스크롤을 아래쪽으로 내린 뒤 왼쪽 관리 메뉴에서 수강 등록 링크를 클릭
 # 등록 요청 버튼을 클릭하는 즉시 등록이 완료
 # 화면을 아래로 스크롤한 뒤 'Unit 3. Hello, world!로 시작하기' 앞의 삼각형을 클릭
 # 강좌 목록을 열고 '3.6 퀴즈'를 클릭
 # 퀴즈 풀기 버튼을 클릭하면 퀴즈를 풀 수 있음
 # 퀴즈 문제를 읽고 답안을 선택한 뒤 체크버튼을 클릭하면 답안이 채점
 # 채점이 끝났으면 다음 버튼을 클릭하여 다음 문제로 넘어감
 # 심사문제를 푸는 방법
 # '3.8 심사문제: 문자열 출력하기'에서 퀴즈 풀기 버튼을 클릭
 # '3.8 심사문제: 문자열 출력하기'는 전체 소스 코드를 작성하는 문제
 # 코드 아래 부분의 정답 입력 상자에 답안을 입력한 뒤 다음 버튼을 클릭
 # 문제 채점 현황과 점수가 표시
 # 모두 제출하고 끝냄 버튼을 클릭합니다(만약 답안을 수정하고 싶다면 시도로 돌아가기 버튼을 클릭)
 # 답안을 완전히 제출하기 전에 확정 창이 표시
 # 모두 제출하고 끝냄 버튼을 클릭
 # 버튼을 클릭하고 잠시 기다리면 완료
 # 화면 아래에 답안의 상태와 문제의 해설이 출력
 # 검토 마침을 클릭하면 퀴즈에 다시 도전할 수 있음
# 참고|뭐가 틀렸는지 모르겠어요.
 # 분명 print 함수로 'Hello, world!'를 두 번 출력했는데 계속 통과를 못하는 경우
 # 여기서 'hello,world!'는 대소문자와 띄어쓰기가 틀렸을 경우
 # 심사문제에서 원하는 출력결과는 'Hello, world!'라서 통과하지 못하는 것
 # 이때는 'Hello, world!'처럼 H를 대문자로 입력하고 ,와 w 사이를 한 칸 띄우면 됨
 # 특히 ,(콤마)와 !(느낌표)도 출력 결과에 반드시 있어야 하므로 빠뜨리지 않도록 주의