# IDLE에서 소스 파일 실행하기
 # print('Hello, world!') 코드를 파일에 저장해서 실행
 # 프로그래밍에서 코드를 파일 형태로 저장한 것을 소스 코드 또는 소스 파일이라고 부름
 # IDLE은 파이썬 셸을 통해 코드를 실습하고 바로 바로 결과를 보는 기능과 소스 파일을 편집하고 실행하는 기능을 함께 제공
 # IDLE을 실행하고 메뉴에서 File > New File을 클릭
 # 내용이 비어 있는 소스 코드 편집창이 나옴
 # 다음 내용을 소스 코드 편집 창에 입력
 # 입력한 파이썬 코드를 실행하려면 .py 파일에 저장 
 # 소스 코드 편집 창의 메뉴에서 File > Save를 클릭하거나 Ctrl+S를 누름
 # 파일 저장 창이 표시되면 C:\project 폴더로 이동한 뒤 hello.py로 저장
 # 파이썬 코드를 hello.py 파일로 저장
 # 소스 코드 편집 창의 메뉴에서 Run > Run Module을 클릭하거나 F5 키를 누르면 IDLE의 파이썬 셸 창에 Hello, world!가 출력
 # IDLE의 소스 코드 편집 창에 내용을 입력한 뒤 실행하면 파이썬 셸 창에 결과가 출력
 # 각자 print( ) 안의 내용을 바꿔서 실행
 # 파이썬 코드를 저장한 .py 파일을 파이썬 스크립트(Python script)