# 주석
 # 파이썬에서 사람만 알아볼 수 있도록 작성하는 부분을 주석(comment)라고 함
 # 주석은 파이썬 인터프리터가 처리하지 않으므로 프로그램의 실행에는 영향을 주지 않음
 # 주석은 파이썬 인터프리터가 처리하지 않으므로 프로그램의 실행에는 영향을 주지 않음
 # 보통 주석은 코드에 대한 자세한 설명을 작성하거나,특정 코드를 임시로 사용하지 않도록 만들 때 사용
 # 주석은 한 줄 주석과 블록 주석 두가지가 있음
# 한 줄 주석 
 # 코트 맨 앞에 #을 사용하면 해당 줄은 모두 주석이됨
 # 코드 뒤에 #으로 주석을 작성할 수도 있음
 # 이때는 앞에 있는 코드만 정상적으로 동작하며 # 뒤에 있는 코드는 동작하지 않음
# 블록 주석
 # 블록 주석은 각 줄마다 맨 앞에 #을 넣어줌
# 참고|파이썬에서 한글 주석 사용하기
 # 파이썬 3에서는 .py 스크립트 파일의 기본 인코딩이 UTF-8
 # 스크립트 파일을 다른 인코딩(CP949, EUC-KR)으로 저장하면 실행을 했을 때 에러가 발생.
 # 대부분의 텍스트 편집기는 저장할 파일의 인코딩을 설정할 수 있음.
 # 메모장에서는 파일(F) > 다른 이름으로 저장(A)… > 인코딩(E)에서 UTF-8을 선택한 뒤 저장합니다.

