# 스마트폰 사용의 일상변화
 # SNS를 통해 손쉽게 주변 사람들의 소식을 주고 받기
 # 몇 번의 터치만으로 은행 업무
 # 스마트폰의 지도와 길 찾기 기능
# 자동차 분야
 # 자동차 엔진은 ECU(Engine Control Unit, 엔진 제어 장치)라는 컴퓨터가 제어
 # 차선 유지 기능
 # 앞 차와의 충돌 방지 기능
 # 자율 주행까지 가능한 컴퓨터가 내장
 # 구글은 자율 주행 시스템을 위해 웨이모를 개발
# 영화 산업 분야
 # 컴퓨터 그래픽스가 필수
 # 컴퓨터와 3D 모델링 소프트웨어
# 금융 업계
 # 오프라인 지점 없이 온라인으로만 영업하는 인터넷 은행은 나오자 마자 큰 돌풍
 # 개인 대출 시장도 인터넷을 통해 대출을 연결해주는 P2P 대출로 발전
 # 국가 중앙은행의 통제를 받지 않는 비트코인 등 가상화폐까지 등장
 # 이들 모두 금융과 소프트웨어가 결합한 핀테크(fintech)
# 유통 업계
 # 미국의 아마존은 인터넷 쇼핑몰을 넘어서서 세계 최대의 클라우드 서비스 업체로 발전
 # 국내도 유통 분야에서 인터넷 쇼핑몰이 보편화
 # 빅데이터를 활용하여 소비자에게 최적화된 상품을 추천해주는 등 소프트웨어를 적극 활용
 # 요즘은 이런 회사들을 유통 업체가 아닌 소프트웨어 업체로 분류
# 생산 분야
 # 3D 프린터가 도입되어 다품종 소량 생산 및 자동화가 가능
 # 의료 업계 중에서도 이미 치과 보철 분야는 3D 프린터를 사용
# 의료 분야
 # 빅데이터와 인공지능을 통해최적화된 치료법을 제공
 # 일상 생활에서도 스마트워치로 심박수, 혈당 수치 측정, 칼로리 께산까지 가능
 # 의료 정보는 모두 소프트웨어로 처리되며 스마트 헬스케어라는 분야로 자리를 잡았음
# 인공지능 발전
 # 인공지능은 사람을 이길 수 없을 것이라 여겨졌던 바둑도 구글 알파고가 나오면서 사람을 압도
 # 일상 생활에서는 스마트폰에 내장된 시리와 빅스비 같은 서비스가 활용 
# 빅데이터 분야
 # 서울시 심야버스 노선 최적화
 # 서울시와 KT는 사람들의 휴대전화 사용위치
 # 신용 카드와 교통카드 결제 데이터
 # 택시 승하차 정보
 # 휴대전화 청구지 주소등을 분석
 # 실제 유동연구를 파악한 뒤 노선을 최적화하여 심야버스의 이용율을 크게 늘림
# 
 # 자율 주행 시스템을 예로 들면 사람의 눈과 귀 역할을 하는 카메라와 센서를 장착해서 주변 상황을 인식하게 하고, 팔과 다리 역할을 하는 각종 제어 장치를 만들어서 사람 없이 움직이게 함
 # 주변 상황 정보, GPS 정보, 지도 정보 등을 이용해서 자동으로 운전하는 소프트웨어를 만듬
# 날씨 데이터를 그래프로 그리는 문제
 # 기상청 웹 사이트의 날씨 데이터를 그래프로 그리는 문제
 # 다음과 같이 주요 도시의 기온과 습도를 막대 그래프로 나타내는 것
 # 기상청 웹 사이트에서 데이터가 어디에 어떻게 표시되는지 알아야 함
 # 보통 웹 사이트는 HTML(HyperText Markup Language)이라는 언어로 글자와 그림을 표시하므로 우리는 HTML을 분석하여 도시 이름, 기온, 습도 값이 저장된 위치를 찾음
 # 분석한 정보를 토대로 HTML에서 기온과 습도 정보를 가져와서 정형화된 데이터로 만듬
 # 데이터 중에서 특별시와 광역시만 추출한 뒤 막대 그래프로 그리면 됨
# 컴퓨터이셔널 싱킹
 # 현실 세계의 문제를 분석하여 해결책을 찾는 과학적 사고법을 컴퓨테이셔널 씽킹(computational thinking)이라 함
 # 설계한 해결책을 컴퓨터의 명령어로 작성하는 것을 컴퓨터 프로그래밍이라함